scripts/performance/load-test.yml
config:
  target: 'http://0.0.0.0:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: 'Ramp up load'
    - duration: 300
      arrivalRate: 100
      name: 'Sustained load'
  processor: './load-test-processor.js'

scenarios:
  - name: 'Home page load'
    weight: 30
    flow:
      - get:
          url: '/'
      - think: 2

  - name: 'CER Generator workflow'
    weight: 25
    flow:
      - get:
          url: '/cer-generator'
      - think: 3
      - post:
          url: '/api/cer/generate'
          json:
            deviceType: 'test'
            indication: 'test indication'
      - think: 5

  - name: 'Document upload'
    weight: 20
    flow:
      - get:
          url: '/coauthor'
      - think: 2
      - post:
          url: '/api/documents/upload'
          beforeRequest: 'setUploadData'
      - think: 3

  - name: 'Search functionality'
    weight: 15
    flow:
      - get:
          url: '/vault'
      - think: 1
      - get:
          url: '/api/search?q=clinical+trial'
      - think: 2

  - name: 'Admin dashboard'
    weight: 10
    flow:
      - get:
          url: '/admin'
      - think: 2
      - get:
          url: '/api/analytics/dashboard'
      - think: 3